app/views/files/tag.html.erb


    <%= select_tag "tags[]", options_for_select(@tags.pluck(:name, :id)), { :multiple => true, class: 'form-control' } %>
---
SELECT "tags"."name", "tags"."id" FROM "tags"