app/controllers/files_controller.rb

INSERT INTO "attachments" ("title", "description", "attachment_type", "document", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @file = current_user.attachments.new(attachment_params)
    @file.attachment_type = 'Private'
    if @file.save

SELECT "attachments".* FROM "attachments" WHERE "attachments"."user_id" = $1 AND "attachments"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def tag
    @file = current_user.attachments.find_by_id(params[:file_id])

SELECT "attachments".* FROM "attachments" WHERE "attachments"."user_id" = $1 AND "attachments"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "attachment_tags" ("attachment_id", "tag_id") VALUES ($1, $2) RETURNING "id"  [["attachment_id", 1], ["tag_id", 2]]
---
  def add_tags
    @file = current_user.attachments.find_by_id(params[:file_id])
    params[:tags].each do |tag_id|
      tag = Tag.find(tag_id)
      @file.attachment_tags.create(tag: tag)

SELECT "attachments".* FROM "attachments" WHERE "attachments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def download_file
    @file = Attachment.find(params[:file_id])