app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "attachments".* FROM "attachments" INNER JOIN "attachment_tags" ON "attachments"."id" = "attachment_tags"."attachment_id" WHERE "attachment_tags"."tag_id" = $1 AND "attachments"."user_id" = $2  [["tag_id", 2], ["user_id", 1]]
---
  def show
    @tag = Tag.find(params[:id])
    @files = @tag.attachments.where(user_id: current_user.id)